chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D31.xml
        <register>
          <name>HEOCFG15</name>
          <description>High-End Overlay Configuration Register 15</description>
          <addressOffset>0x000003C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSCGY</name>
              <description>Color Space Conversion Y coefficient for Green Component 1:2:7 format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCGU</name>
              <description>Color Space Conversion U coefficient for Green Component 1:2:7 format</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCGV</name>
              <description>Color Space Conversion V coefficient for Green Component 1:2:7 format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCUOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG16</name>
          <description>High-End Overlay Configuration Register 16</description>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSCBY</name>
              <description>Color Space Conversion Y coefficient for Blue Component 1:2:7 format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCBU</name>
              <description>Color Space Conversion U coefficient for Blue Component 1:2:7 format</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCBV</name>
              <description>Color Space Conversion V coefficient for Blue Component 1:2:7 format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCVOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG17</name>
          <description>High-End Overlay Configuration Register 17</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI0COEFF0</name>
              <description>Horizontal Coefficient for phase 0 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI0COEFF1</name>
              <description>Horizontal Coefficient for phase 0 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI0COEFF2</name>
              <description>Horizontal Coefficient for phase 0 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI0COEFF3</name>
              <description>Horizontal Coefficient for phase 0 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG18</name>
          <description>High-End Overlay Configuration Register 18</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI0COEFF4</name>
              <description>Horizontal Coefficient for phase 0 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG19</name>
          <description>High-End Overlay Configuration Register 19</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI1COEFF0</name>
              <description>Horizontal Coefficient for phase 1 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI1COEFF1</name>
              <description>Horizontal Coefficient for phase 1 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI1COEFF2</name>
              <description>Horizontal Coefficient for phase 1 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI1COEFF3</name>
              <description>Horizontal Coefficient for phase 1 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG20</name>
          <description>High-End Overlay Configuration Register 20</description>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI1COEFF4</name>
              <description>Horizontal Coefficient for phase 1 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG21</name>
          <description>High-End Overlay Configuration Register 21</description>
          <addressOffset>0x000003E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI2COEFF0</name>
              <description>Horizontal Coefficient for phase 2 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI2COEFF1</name>
              <description>Horizontal Coefficient for phase 2 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI2COEFF2</name>
              <description>Horizontal Coefficient for phase 2 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI2COEFF3</name>
              <description>Horizontal Coefficient for phase 2 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG22</name>
          <description>High-End Overlay Configuration Register 22</description>
          <addressOffset>0x000003E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI2COEFF4</name>
              <description>Horizontal Coefficient for phase 2 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG23</name>
          <description>High-End Overlay Configuration Register 23</description>
          <addressOffset>0x000003E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI3COEFF0</name>
              <description>Horizontal Coefficient for phase 3 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI3COEFF1</name>
              <description>Horizontal Coefficient for phase 3 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI3COEFF2</name>
              <description>Horizontal Coefficient for phase 3 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI3COEFF3</name>
              <description>Horizontal Coefficient for phase 3 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG24</name>
          <description>High-End Overlay Configuration Register 24</description>
          <addressOffset>0x000003EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI3COEFF4</name>
              <description>Horizontal Coefficient for phase 3 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG25</name>
          <description>High-End Overlay Configuration Register 25</description>
          <addressOffset>0x000003F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI4COEFF0</name>
              <description>Horizontal Coefficient for phase 4 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI4COEFF1</name>
              <description>Horizontal Coefficient for phase 4 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI4COEFF2</name>
              <description>Horizontal Coefficient for phase 4 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI4COEFF3</name>
              <description>Horizontal Coefficient for phase 4 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG26</name>
          <description>High-End Overlay Configuration Register 26</description>
          <addressOffset>0x000003F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI4COEFF4</name>
              <description>Horizontal Coefficient for phase 4 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG27</name>
          <description>High-End Overlay Configuration Register 27</description>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI5COEFF0</name>
              <description>Horizontal Coefficient for phase 5 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF1</name>
              <description>Horizontal Coefficient for phase 5 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF2</name>
              <description>Horizontal Coefficient for phase 5 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF3</name>
              <description>Horizontal Coefficient for phase 5 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG28</name>
          <description>High-End Overlay Configuration Register 28</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI5COEFF4</name>
              <description>Horizontal Coefficient for phase 5 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG29</name>
          <description>High-End Overlay Configuration Register 29</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI6COEFF0</name>
              <description>Horizontal Coefficient for phase 6 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF1</name>
              <description>Horizontal Coefficient for phase 6 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF2</name>
              <description>Horizontal Coefficient for phase 6 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF3</name>
              <description>Horizontal Coefficient for phase 6 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG30</name>
          <description>High-End Overlay Configuration Register 30</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI6COEFF4</name>
              <description>Horizontal Coefficient for phase 6 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG31</name>
          <description>High-End Overlay Configuration Register 31</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI7COEFF0</name>
              <description>Horizontal Coefficient for phase 7 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF1</name>
              <description>Horizontal Coefficient for phase 7 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF2</name>
              <description>Horizontal Coefficient for phase 7 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF3</name>
              <description>Horizontal Coefficient for phase 7 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG32</name>
          <description>High-End Overlay Configuration Register 32</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI7COEFF4</name>
              <description>Horizontal Coefficient for phase 7 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG33</name>
          <description>High-End Overlay Configuration Register 33</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI0COEFF0</name>
              <description>Vertical Coefficient for phase 0 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI0COEFF1</name>
              <description>Vertical Coefficient for phase 0 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI0COEFF2</name>
              <description>Vertical Coefficient for phase 0 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG34</name>
          <description>High-End Overlay Configuration Register 34</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI1COEFF0</name>
              <description>Vertical Coefficient for phase 1 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI1COEFF1</name>
              <description>Vertical Coefficient for phase 1 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI1COEFF2</name>
              <description>Vertical Coefficient for phase 1 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG35</name>
          <description>High-End Overlay Configuration Register 35</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI2COEFF0</name>
              <description>Vertical Coefficient for phase 2 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI2COEFF1</name>
              <description>Vertical Coefficient for phase 2 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI2COEFF2</name>
              <description>Vertical Coefficient for phase 2 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
